DAYS_AND_SIGNS = [
    {(1, 20): 'Козирог', (20, 32): 'Водолей'},
    {(1, 19): 'Водолей', (19, 30): 'Риби'},
    {(1, 21): 'Риби', (21, 32): 'Овен'},
    {(1, 21): 'Овен', (21, 31): 'Телец'},
    {(1, 21): 'Телец', (21, 32): 'Близнаци'},
    {(1, 21): 'Близнаци', (21, 31): 'Рак'},
    {(1, 22): 'Рак', (22, 32): 'Лъв'},
    {(1, 23): 'Лъв', (23, 32): 'Дева'},
    {(1, 23): 'Дева', (23, 31): 'Везни'},
    {(1, 23): 'Везни', (23, 32): 'Скорпион'},
    {(1, 22): 'Скорпион', (22, 31): 'Стрелец'},
    {(1, 22): 'Стрелец', (22, 32): 'Козирог'}
]


def what_is_my_sign(day, month):
    for key in DAYS_AND_SIGNS[month - 1]:
        if day in range(*key):
            return DAYS_AND_SIGNS[month - 1][key]
